---
kind: other
id: Properties.T:Autodesk.Revit.UI.Macros.DocumentEntryPoint
source: html/9df48123-f4a9-6a29-f4c6-287a91b35eae.htm
---
# DocumentEntryPoint Properties

The currently active graphical view of the currently active document.